# WrongConstraintInTrussSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..WrongConstraintInTrussSketch Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Structural Truss sketch can't be constrained to its members.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongConstraintInTrussSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongConstraintInTrussSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongConstraintInTrussSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace